W4D5_HW/MusicApp/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "tDpFE6d1chjGzuWIihvIrA"], ["updated_at", "2018-11-15 22:00:53.384727"], ["id", 2]]
---
  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save